<template>
  <div class="navHeader">

    <el-button type="text" @click="dialogFormVisible = true" icon="search">訪客</el-button>
    <el-button type="text" icon="search">購物籃</el-button>

    <el-dialog title="登入" v-model="dialogFormVisible">
      <el-form label-position="top" :model="form">
        <el-form-item label="元氣卡編號/電郵地址">
          <el-input v-model="form.name" auto-complete="off"></el-input>
        </el-form-item>
        <el-form-item label="密碼">
          <el-input v-model="form.name" auto-complete="off"></el-input>
        </el-form-item>
        <el-form-item>
          <el-checkbox label="記住我" name="type"></el-checkbox>
          <a style="text-decoration:underline;display:inline-flex"
             href="https://members.genkisushi.com.hk/tc/forget_password.php"><p
          >忘記密碼</p></a>
        </el-form-item>
        <el-form-item>
          <textarea rows="5" cols="60" readonly="" style="resize: none;">
            元気寿司外賣自取網上訂購服務條款及細則

2016年11月21日
1.	總則
	當你透過本網站使用元氣壽司(香港)有限公司（下稱「元気寿司」) 在香港提供的外賣自取網上訂購服務，即表示你同意及接受本條款及細則之約束。元気寿司有權在任何時候及不時修改本條款及細則，我們會在本網站發佈修改的條款。

2.	「外賣自取網上訂購服務」系統要求
	閣下必須透過任何連接到互聯網的電腦、流動電話或平板電腦使用元氣壽司外賣自取網上訂購系統進行訂購。元気寿司建議閣下使用下列之瀏覽器，達致最佳瀏覽效果：
	- Internet Explorer 11 / Chrome 31 / Firefox 27 / Safari 7或以上
	- 建議解像度：1024 x 768
	- 必須啟動Javascript及Cookies

3.	資格與登入
	3.1	本網上訂購服務開放予香港「元気卡」會員及非會員使用。使用元気寿司外賣自取網上訂購系統（下稱「網上訂購系統」)進行訂購前，必須閱讀並同意本網站的有關使用條款和私隠政策及聲明。「元気卡」會員使用權不可轉讓，會員可能會被要求提供身份證明以核實身份。所有使用者須為進入網上訂購系統之後的一切活動負責。
	3.2	「元気卡」會員須以「元気卡」號碼或「元気卡」登記之電郵地址及「元気卡」個人密碼登入網上訂購系統，方可使用「元気積分」及進行訂購服務。
	3.3 非「元気卡」會員及元気累計卡賬戶可以訪客身份進行訂購。
	3.4 元気累計卡賬戶於「網上訂購系統」的消費亦會計算入該累計卡的累積消費金額內。
	3.5	「元気卡」會員及非會員須為你於網上訂購的一切行為負責。
	3.6	元気寿司有絕對酌情權，因任何理由而拒絕或終止任何人使用訂購系統。

4 外賣聖誕盛網上訂購

4.1 本網站只提供外賣自取網上訂購服務，並不設送貨服務。
4.2 外賣聖誕盛訂購日期為：2016年11月21日至2017年1月2日; 取貨日期：2016年12月12日至2017年1月2日。
4.3 分店提供取貨的時間為每日早上11:30至晚上10:00。即日提取的訂單須於預計取貨時間前3小時完成訂購。
4.4 進入網站進行網上訂購時，你需要提供電郵地址以接收我們發出的網上訂購確認電郵，及提供電話號碼以作聯絡之用。若你提供的電話號碼為他人的資料，你必須確定已得到當事人的同意。你需要為提供及使用此等個人資料承擔所有責任。
4.5 你在本網站提交的訂單， 需經元気寿司接受和確認，方可作實。網上訂單一經確認，你不可取消或更改已訂購的貨品。
4.6 更改網上訂單之取貨分店、日期及時間的功能暫時停止，直到另行通知。
4.7 於2016年11月21日至12月20日期間訂購的外賣聖誕盛，元気卡會員可享8折優惠，非會員可享9折優惠。於2016年12月21日至2017年1月2日訂購，元気卡會員可享85折優惠。
4.8 於2016年11月21日至2017年1月2日期間訂購外賣聖誕盛滿$250可獲$30優惠券1張及2017年元気別注版月曆1個；滿$500可獲$30優惠券2張及2017年元気別注版月曆2個，如此類推。消費金額以原價並扣除其他優惠或折扣後及使用「元気の賞分」前之單一發票總額計算。數量有限，派完即止。
4.9 此推廣之所有優惠不可與其他元気寿司優惠券、現金券、推廣優惠或其他折扣優惠同時使用。
4.10 如需於不同日期或分店提取訂購之外賣，必須分開獨立訂購及付款。

5.	貨品資訊及價格
	5.1	元気寿司會不時更新在本網站提供的各款貨品資料及價格。所有貨品資料及價格，以元気寿司確認訂單時為準。
	5.2	我們會盡一切努力確保本網站載列的貨品存貨充足，如因任何貨品缺貨而未能提供予顧客，本公司有權於得到顧客的同意下提供相近價格及種類的貨品以供替代。
	5.3	在本網站提供的貨品價格只適用於外賣自取網上訂購。部分產品的價格可能與元気寿司分店提供的價格不同。
	5.4	元気寿司有權對網上訂購貨品的種類和數量作出限制及/或拒絕接受任何網上訂單。
	5.5 產品資料、價格及圖片只供參考。

6.	使用及賺取元気の賞分(「元気卡」會員適用)
	6.1	香港「元気卡」會員網上訂購可使用「元気の賞分」。使用「元気の賞分」須受「元気卡」會員計劃條款及細則約束，有關詳情請瀏覽 http://members.genkisushi.com.hk。
	6.2	網上訂購的貨款總額扣除「元気の賞分」後，貨款餘額須於網上以信用卡付款。
	6.3	「元気卡」會員之生日月份優惠不適用於惠顧元気寿司外賣自取網上訂購服務。
	6.4 購買任何元気外賣聖誕盛之消費將不獲「元気の賞分」。

7.	付款
	7.1	惠顧網上訂購服務的貨款總額，或扣除「元気の賞分」後的貨款餘額（如適用），必須於網上以信用卡付款（VISA或Mastercard）。
	7.2	所有貨品之價值均以港幣計算。
	7.3	為提供安全可靠的網上外賣訂購服務，我們的網上交易使用安全接層加密技術 Secure Sockets Layer （SSL）。所有個人資料包括你的信用卡號碼、姓名會經過加密，才透過互聯網傳送，防止你的資料在網上傳送時，被未經許可的第三者閱讀。
	7.4	元気寿司可隨時修改網上訂購的付款方式，我們會在本網站發佈修改的條款。

8.	取貨
	8.1	每日可選擇之取貨時間為早上11:30至晚上10:00。如個別分店因營運狀況於某些日期或時間未能提供取貨服務, 將於顧客選擇取貨時間時列明。顧客可選擇其他取貨時間或其他分店取貨。
	8.2	若你未能於訂單上所列明之日期及時間之4小時內，到訂單上所列明之取貨分店憑訂單條碼或其列印本取貨，將當作自動放棄論，所繳付之款項將不獲退還。
	8.3	取貨時，必須出示有效的訂單條碼或其列印本予分店職員核對。每張訂單之訂單條碼只可供取貨一次。所有取貨記錄以元気寿司網上訂購系統之記錄為準, 不得異議。
	8.4	你有責任小心保管取貨所用的訂單條碼或其列印本。任何人士憑訂單條碼或其列印本取貨將被視為已獲得你的授權取貨。

9.	退貨或退款
	9.1	網上訂單一經確認，你不可取消或更改已訂購的貨品。
	9.2	完成訂購付款後，恕不接納退款、退貨或退換。


疑問或疑慮
若你對此等條款及細則有任何疑問或意見，可致電外賣自取服務專線(852) 2101-1600。
多謝你瀏覽http://order.genkisushi.com.hk 。

            </textarea>
        </el-form-item>
        <el-form-item>
          <el-checkbox label="本人已閱讀並同意以上條款及細則。" name="type"></el-checkbox>
        </el-form-item>
      </el-form>
      <div slot="footer" class="dialog-footer">
        <el-button @click="dialogFormVisible = false">登入</el-button>
        <el-button type="primary" @click="dialogFormVisible = false">以訪客身份訂購</el-button>
      </div>
    </el-dialog>
  </div>
</template>
<style>

</style>
<script>
    export default{
      name: 'navHeader',
        data(){
            return{
                msg:'header vue',
                 dialogFormVisible: false,
                     form: {
          name: '',
          region: '',
          date1: '',
          date2: '',
          delivery: false,
          type: [],
          resource: '',
          desc: ''
        },
        }
        }
    }





</script>
